<template>
  <div class="home-container">
    <div class="title">人生导师用户隐私权政策</div>
    <div class="update-time">
      <span>更新日期：2025年2月25日</span>
      <span>生效日期：2025年2月25日</span>
    </div>

    <div class="main-title">引言</div>
    <div class="item-name" v-for="el of list" v-html="el"></div>
    <div class="main-title">目录</div>
    <div class="item-name" v-for="el of list1" v-html="el"></div>

    <div v-for="item of list3">
      <div class="main-title">{{ item.title }}</div>
      <div class="remark" v-html="item.remark"></div>
      <div class="sub-wrap" v-for="item2 of item?.list">
        <div class="sub-title" v-html="item2.subTitle"></div>
        <div class="item" v-for="el of item2.list">
          <div class="item-name" v-html="el.name"></div>
          <div class="item-list" v-for="v of el.list" v-html="v"></div>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
const list = [
  '人生导师（以下简称为“我们”）尊重并保护所有人生导师用户的个人信息及隐私安全。我们依据《中华人民共和国网络安全法》《中华人民共和国个人信息保护法》《中华人民共和国民法典》《信息安全技术个人信息安全规范》以及其他相关法律法规和技术规范明确了我们收集/使用/对外提供个人信息的原则，进一步阐述了关于您个人信息的相关权利。',
  '本政策与您所使用的我们的产品与/或服务息息相关，您在下载、安装、启动、浏览、注册、登录、使用我们的产品与/或服务（以下统称“使用我们的产品与/或服务”）时，我们将按照本政策的约定处理和保护您的个人信息。我们尽量以简明扼要的表述向您解释本政策所涉及的技术词汇，以便于您理解。本政策中与您权益（可能）存在重大关系的条款，<span style="font-weight:600">我们已使用加粗字体予以区别，请您重点查阅。</span>',
  '人生导师特别提请未满18周岁的未成年（特别是未满十四周岁的儿童）及其监护人的注意，<span style="font-weight:600">我们已明确未成年保护专门章节（以粗体提示），请您仔细阅读。</span>',
  '请在使用/继续使用我们的各项产品与服务前，仔细阅读并充分理解本政策，并在需要时，按照本政策的指引，做出适当的选择。如果您不同意本政策的内容，将可能导致我们的产品与/或服务无法正常运行，或者无法达到我们拟达到的服务效果，您应立即停止访问/使用我们的产品与/或服务。您使用或继续使用我们提供的产品与/或服务的行为，都表示您充分理解和同意本《人生导师用户隐私政策》（包括更新版本）的全部内容。',
  '关于我们',
  '人生导师网站及APP的经营者为<span style="font-weight:600">北京奕淇科技有限公司及其关联公司。</span>',
  '注册地址为北京市平谷区中关村科技园区平谷园1区-211169（集群注册）。'
];
const list1 = [
  '一、我们如何收集和使用您的个人信息',
  '二、我们如何共享、转让、公开披露您的个人信息',
  '三、我们如何存储和保护您的个人信息',
  '四、您如何管理您的个人信息',
  '五、您如何注销您的账号',
  '六、有关第三方提供产品和/或服务的特别说明',
  '七、我们如何使用Cookie和其他同类技术',
  '八、未成年人保护',
  '九、我们如何更新隐私政策',
  '十、如何联系我们',
  '十一、其他'
];

const list3 = [
  {
    title: '一、我们如何收集和使用您的个人信息',
    remark:
      '您理解并同意：我们会遵循正当、合法、必要的原则，出于本政策所述的以下目的，收集和使用您在使用我们服务过程中主动提供或因使用我们产品和/或服务而产生的个人信息。如果我们要将您的个人信息用于本政策未载明的其它用途，或基于特定目的将已经收集的信息用于其他目的，我们将以合理的方式向您告知，并在使用前再次征得您的同意',
    list: [
      {
        subTitle: '1.账号注册及登录',
        list: [
          {
            name: '1.1.当您注册及登录时，如您使用一键登录的功能，基于我们与通信运营商的合作，我们会收集您的【手机号码和网络运营商信息】，以便为您提供快捷的登录服务；<span style="font-weight:600">同时，为帮助您完成注册过程，我们还将收集您的【性别】、【兴趣】和【年龄】，以为您提供人生导师初始服务。如不希望提供，您可以跳过此步骤。</span>'
          },
          {
            name: '1.2.如您使用第三方账号进行登录，为了满足网络实名制要求，在您使用发布、评论及其他要求实名认证的功能与服务前，我们将另行收集您的手机号码以完成实名认证。请您谨慎考虑后提供这类信息，若您拒绝提供，您可能无法正常使用相应的功能。'
          },
          {
            name: '1.3. 您还可以根据自身需求选择填写或更改头像、昵称、性别、年龄、学校、学历、专业、简介来完善您的信息，但如您不提供此类信息，不会影响您使用本产品和相关服务。'
          },
          {
            name: '1.4. 如果您成功注册人生导师账号，<span style="font-weight:600">我们会在人生导师应用程序及网站中显示您的名字、头像、地区、简介信息。</span>'
          }
        ]
      },
      {
        subTitle: '2.向您提供产品和服务',
        list: [
          {
            name: '2.1.实时一对一咨询服务。为了向您提供我们最核心的咨询服务及相关信息，我们会收集您填写的个人资料。'
          },
          {
            name: '2.2安全运行与风控验证。为了保障软件与服务的安全运行，防止您的个人信息被非法获取，更准确地预防欺诈和保护账号安全，我们会主动收集您的设备信息【包括：设备/硬件型号、设备名称、SIM卡序列号（如ICCID）、硬件/设备序列号（SN）、设备唯一标识符（包括：IMEI、IMSI、Android ID、IDFA、IDFV、OAID(Harmony OS)、OAID(Android)、MEID）】、运行中的进程、存储（相册、媒体和其他文件）、浏览器类型和设置、语言设置、传感器、操作系统、操作系统版本号和应用程序版本、应用列表、网络设备硬件地址（MAC地址）、WLAN-MAC、WLAN接入点（如SSID，BSSID）、IP地址、蓝牙地址、接入网络的方式、网络质量数据、基站、移动网络信息（包括运营商名称）、设备传感器数据（如加速度传感器、线性加速度传感器、重力传感器、陀螺仪传感器）、软件版本号以及软件使用记录信息上传到服务器处理，用于安全风控验证。如您不同意我们收集前述信息，可能无法完成风控验证。请您理解，为动态检测您的账户是否存在异常登录，每次您把人生导师切换至后台或重新启动程序时，我们可能会再次读取，我们将把读取频次控制在合理范围内。为了维护网络安全、保障良好生态，您的IP地址所对应的归属地域信息将会展示在您的个人资料页、笔记发布页和评论中。境内展示到省(区、市)，境外展示到国家(地区)，信息以网络运营商数据为准。'
          },
          {
            name: '2.3.呼叫提问功能。当您使用人生导师呼叫提供功能时，我们会收集分析您的提问指令（可能是文本或者图像形式）、阅读记录和访问时间和互动记录,同时亦可以改进我们的产品和服务。'
          },
          {
            name: '2.4.基于地理位置的功能服务 。当您通过系统授权开启移动设备的定位功能并使用人生导师基于地理位置提供的相关服务（包括基于地理位置的内容推荐、附近功能以及附近功能地图界面上本地生活信息和互动内容的展示、内容发布时的位置定位、购物编辑收货信息和资料编辑）时，我们会收集和使用您的位置信息以便为您提供上述服务。您可以在移动设备的系统中关闭定位服务停止我们对您所在位置信息的收集，但不影响您正常使用人生导师的其他功能。我们也仅会基于网络信息（如IP）、或经过你授权的相应地理位置信息对应的城市及/或区县及/或街道向您展示可能相关的内容或服务。'
          },
          {
            name: '2.5.购买、查询、使用虚拟财产。为了方便您查询虚拟财产，并尽量降低可能存在的风险，【我的小金库】会记录您的充值、余额与使用情况。'
          },
          {
            name: '<span style="font-weight:600">2.6.身份认证功能及账号找回。</span>',
            list: [
              '（1）<span style="font-weight:600;font-size:15px;color:red">当您使用身份认证功能申请成为认证用户时，我们可能会收集您的身份信息，包括您的真实姓名、身份证件号码或照片、面部识别信息，用于证实您的个人身份。若您拒绝提供，不会影响人生导师其他功能的正常使用。</span>',
              '（2）<span style="font-weight:600;font-size:15px;color:red">当您使用账号找回功能时，我们可能会收集您的身份信息，包括您的真实姓名、身份证件号码或照片、面部识别信息，用于证实您的身份，便于您找回人生导师账号。若您拒绝提供，不会影响人生导师其他功能的正常使用。</span>'
            ]
          },
          {
            name: '2.7.客服和售后服务功能。当您联系我们的客服或提出我们的产品与/或服务的售后申请时，我们系统可能会记录您与客服之间的通讯记录。为了您的账号与系统安全，我们可能需要您提供相关个人信息与您之前提供的个人信息相匹配以验证您的用户身份。验证成功后，我们可能会收集您与我们的沟通信息（账号信息、订单信息、您为了证明相关事实而提供的图片/视频/文字信息及有关信息）、您的联系方式以及您与我们的沟通记录，包括线上沟通记录、电话录音，以便尽快为您解决问题和改进我们的产品与/或服务。同时，我们可能会以电话、短信、站内信及相关方式主动联系您，沟通您在使用我们产品及服务过程中产生的问题。为了保证服务的体验、处理服务纠纷，您与客服间的通话信息可能会被录音。有关上述信息的收集和使用规则如下：',
            list: [
              '（1）<span style="font-weight:600">当您使用人生导师服务与平台或者导师发生纠纷时</span>，我们可调取并使用录音信息作为解决纠纷的参考依据。',
              '（2）为了向您提供客服和售后服务，我们可能将您的通话录音存储在第三方客服系统中，我们会通过协议约束等方式，确保第三方无法访问您的通话录音；除以下情形外，平台不会将录音提供给任何人（包括通话主、被叫方）：a.有权机关依法定程序调取；b.被录音的一方持司法机关出具的法律文件依法调取。'
            ]
          },
          {
            name: '2.8.支付功能。<span style="font-weight:600">您可以在人生导师购买服务以及人生导师会员服务。</span>在您使用该功能的过程中可能会需要进行支付，在支付过程中，我们可能会收集您的第三方支付账号（支付宝账号、微信账号、银联账号及有关账号）。'
          },
          {
            name: '2.9.<span style="font-weight:600">信息预填写功能。您在人生导师平台填写个人表单信息时，为帮您节省填写时间，我们会为您预生成用户昵称，您可以根据情况进行修改。</span>'
          },
          {
            name: '2.10.在您分享或被分享信息、参加活动情形下，我们需要访问您的剪切板，读取其中包含的口令、分享码、链接，以为您实现跳转、分享、活动联动功能或服务。'
          },
          {
            name: '2.11.设备权限调用汇总我们对人生导师在提供服务过程中，会调用您的主要设备权限汇总如下。您可以在设备的设置功能中选择关闭部分或全部权限。在不同设备中，权限显示方式及关闭方式可能有所不同。'
          }
        ]
      },
      {
        subTitle: '3.我们可能从第三方间接获取您的个人信息',
        list: [
          {
            name: '如您使用第三方平台的账号登录时，经过您明确授权账号绑定后，第三方平台会向我们同步您在该平台上使用的头像、昵称、地区（如有）、性别（如有）及好友信息（针对微博平台），以使您可以直接登录并使用人生导师。'
          },
          {
            name: '如您不希望被推荐给微博好友，可以在【我】-【设置】-【隐私】-【不把我推荐给微博好友】中选择关闭。'
          }
        ]
      },
      {
        subTitle: '4.征得授权同意的例外',
        list: [
          {
            name: '根据相关法律法规的规定，在以下情形中，我们可以在不征得您的授权同意的情况下收集、使用一些必要的个人信息：',
            list: [
              '（1）为订立、履行个人作为一方当事人的合同所必需，或者按照依法制定的劳动规章制度和依法签订的集体合同实施人力资源管理所必需；',
              '（2）为履行法定职责或者法定义务所必需；',
              '（3）为应对突发公共卫生事件，或者紧急情况下为保护自然人的生命健康和财产安全所必需；',
              '（4）为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息；',
              '（5）依照《个人信息保护法》规定在合理的范围内处理个人自行公开或者其他已经合法公开的个人信息；',
              '（6）法律法规规定的其他情形。'
            ]
          }
        ]
      }
    ]
  },
  {
    title: '二、我们如何共享、转让、公开披露您的个人信息',
    remark:
      '1.共享：对于您的个人信息，我们不会与任何公司、组织和个人进行共享，除非存在以下一种或多种情形：',
    list: [
      {
        subTitle: '（1）事先已得到您的授权；',
        list: []
      },
      {
        subTitle: '（2）您自行提出的；',
        list: []
      },
      {
        subTitle:
          '（3）与商业合作伙伴的必要共享：您理解并知悉，为了向您提供更完善、优质的产品和服务，我们将授权商业合作伙伴为您提供部分服务。此种情形下，我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。请您注意，我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们将对信息数据的输出形式、流转、使用进行安全评估与处理，以保护数据安全。同时，我们会对合作伙伴进行严格的监督与管理，一旦发现其存在违规处理个人信息的行为，将立即停止合作并追究其法律责任。目前，我们的合作伙伴包括以下类型，具体请查阅《第三方信息共享清单》：',
        list: [
          {
            name: 'A.广告和统计分析类合作伙伴：为帮助进行广告或决策建议、提高广告有效触达率、进一步了解用户需求，我们可能会与委托我们进行信息推广和广告投放的合作伙伴、或统计分析类合作伙伴共享去标识化的设备信息或统计信息，这些信息难以或无法与你的真实身份相关联。请您知悉，为了您的信息安全，我们目前仅与已签署严格数据安全保密协议的合作伙伴进行合作。'
          },
          {
            name: 'B.内容审核服务商：为保证用户在互联网信息平台上发布的内容是安全的，我们可能会向委托的第三方内容审核服务商共享您在平台上发布的内容信息。'
          },
          {
            name: 'C.实名认证审核服务商：当您进行实名认证或使用找回账号功能时，我们会向第三方审核服务商共享您的个人信息，以便您顺利找回账号。'
          },
          {
            name: 'D.第三方小程序：当您使用第三方小程序时，未经您同意，我们不会向这些开发者、运营者共享您的个人信息。当您使用小程序时，小程序可能会使用您授权的相关系统权限，您可以在相应的小程序中撤回该等授权。'
          },
          {
            name: 'E.其他业务合作伙伴：委托我们进行推广和广告投放相关的合作伙伴。以帮助其进行广告或决策建议、提高广告有效触达率、进一步了解用户需求。但我们承诺：未经您的同意，我们不会与其共享可以识别您身份的个人信息。'
          },
          {
            name: 'F.合作的第三方SDK服务商：当您使用人生导师APP中由第三方提供的功能时，我们可能会接入由第三方提供的软件开发包（SDK）以实现相关功能。此时，第三方SDK服务商可能会收集您相关的个人信息。我们会尽到审慎义务，对前述第三方SDK进行严格的安全监测，以保护个人信息安全:',
            list: [
              'a. 一键登录SDK：为了更便捷的登录客户端，我们使用了“极光”的一键登录SDK，在用户进行客户端登录时读取您的设备标识（Android：AndroidID，IOS：IDFA、IDFV）、IP地址、运营商、SIM卡信息、网络状态，以便实现本机号码的快速登录功能;',
              'b.第三方账号登录功能：为给您提供第三方账号登录的功能，第三方服务商可能会获取您的必要设备信息、网络相关信息、地理位置、存储（相册、媒体和其他文件）（包括在后台状态下收集）信息；',
              'c.VIVO推送SDK（仅限Android系统）：为了有订单消息或者聊天消息时，推送通知给用户，我们使用了维沃移动通信有限公司的VIVO推送SDK，需要搜集手机系统版本，手机型号，手机品牌信息，手机号，如您不提供前述权限，可能会影响您正常使用该功能。C1 小米推送SDK（仅限Android系统）：为了有订单消息或者聊天消息时，推送通知用户，我们使用了小米科技有限责任公司的小米消息推送SDK，需要搜集手机系统版本，手机型号，手机品牌信息，手机号，如您不提供前述权限，可能会影响您正常使用该功能;C2 OPPO推送SDK（仅限Android系统）：为了有订单消息或者聊天消息时，推送通知用户，我们使用了OPPO广东移动通信有限公司的OPPO推送SDK，需要搜集手机系统版本，手机型号，手机品牌信息，手机号，如您不提供前述权限，可能会影响您正常使用该功能;C3 华为HMS SDK（仅限Android系统）：为了有订单消息或者聊天消息时，推送通知用户，我们使用了华为技术有限公司的华为HMS SDK，需要搜集手机系统版本，手机型号，手机品牌信息，手机号，如您不提供前述权限，可能会影响您正常使用该功能;C4 荣耀推送 SDK（仅限Android系统）：为了有订单消息或者聊天消息时，推送通知用户，我们使用了深圳荣耀软件技术有限公司的推送 SDK，需要搜集手机系统版本，手机型号，手机品牌信息，手机号，如您不提供前述权限，可能会影响您正常使用该功能;',
              'd.地理位置服务：为给您提供地理位置服务（内容推荐、内容发布、资料编辑），第三方地理位置服务商会收集您的设备信息及地理位置信息以便可以向您推送附近内容；',
              'e.阿里云对象存储SDK: 我们使用了阿里云计算有限公司的对象存储SDK，把数据上传到对象存储，或者从对象存储上下载数据，需要收集个人信息类型：设备型号，设备操作系统信息。如您不提供前述权限，可能会影响您正常使用该功能。',
              'f.账号安全服务：为保障您和其他用户的账号与财产安全，使您和我们的正当合法权益免受不法侵害，第三方安全服务商可能会收集您的必要设备信息、网络相关信息、运营商信息、日志信息、存储（相册、媒体和其他文件）（包括在后台状态下收集）信息以提供账号安全服务。',
              'g. 支付宝SDK（仅限Android系统）：为了给支付问题费用，我们使用了蚂蚁科技集团股份有限公司的支付宝SDK，需要搜集手机系统版本，手机型号，手机品牌信息，手机号，如您不提供前述权限，可能会影响您正常使用该功能。'
            ]
          },
          {
            name: 'G.极光推送SDK',
            list: [
              '第三方主体：深圳市和讯华谷信息技术有限公司',
              'SDK用途：为APP用户提供信息推送服务',
              '收集个人信息类型：',
              '设备参数及系统信息(设备类型、设备型号、系统版本、及相关硬件信息)：用于识别用户的设备类型、设备型号、系统版本等，确保消息准确下发；',
              '设备标识符（IMEI、IDFA、Android ID、GAID、 MAC、OAID、VAID、AAID、IMSI、MEID、UAID、硬件序列号信息、ICCID、SIM信息）：用于识别唯一用户，保证推送的精准送达及推送信息的准确统计；网络信息(IP 地址、WiFi 信息、基站信息、DNS地址、DHCP地址、SSID、BSSID)与位置信息（经纬度）：用于优化SDK与极光服务器的网络连接请求，保证服务的稳定性和连续性，同时实现区域推送功能；应用列表信息(应用崩溃信息、通知开关状态、APP 应用列表及活跃状态、APP 应用页面信息、APP 功能事件相关信息)：当一个设备有多个 APP 的推送链路同时活跃时，我们采用合并链路技术，随机合并成一条链路，以达到为用户节省电省流量的目的。',
              '腾讯微信支付SDK：为了支付问题费用，我们使用了深圳市腾讯计算机系统有限公司的微信支付SDK，需要搜集手机系统版本，手机型号，手机品牌信息，手机号，如您不提供前述权限，可能会影响您正常使用该功能。',
              '数据处理方式：通过去标识化、加密传输及其他安全方式',
              '官网链接：https://www.jiguang.cn/push',
              '隐私政策链接：https://www.jiguang.cn/license/privacy'
            ]
          },
          {
            name: 'H.维智定位SDK ',
            list: [
              '我们项目用到了第三方维智定位 SDK(com.wayz.location)，用于获取经纬度定位功能，为了更好的为客户服务，我们会在发送位置信息的时候获取您的定位，设备序列号，加速度传感器，距离传感器，手机号码，MEID,MAC,IMEI信息功能，具体隐私政策详见官网。',
              '官网链接：https://lothub.newayz.com/sdk_policy/index.html'
            ]
          },
          {
            name: 'I.友盟统计SDK',
            list: [
              'SDK名称：友盟SDK',
              '服务类型：请按SDK功能填写，如统计分析、收集个人信息类型',
              '设备信息（IMEI/MAC/Android ID/OAID/IDFA/OpenUDID/GUID/IP地址/ICCID/SIM 卡 IMSI 信息等）',
              '隐私权政策链接：https://www.umeng.com/page/policy',
              '采集目的:',
              '基于设备信息用于生成脱敏的终端用户设备唯一性标识，以确保提供SDK服务；',
              '基于粗略位置用于区域维度的应用分析，提供地区数据报表；',
              '卸载分析功能：基于应用列表实现应用安装与卸载统计；'
            ]
          },
          {
            name: 'J.音频SDK',
            list: [
              'SDK名称：音频 SDK;',
              'SDK公司名称：上海声网科技有限公司;',
              'SDK使用目的和功能场景：提供语音通信服务，包括语音通话;',
              'SDK涉及的个人信息类型：设备品牌、设备型号、操作系统版本、CPU 信息、内存使用情况、电池电量信息、IP 地址、网络接入方式和类型、频道内的用户ID;',
              '实现SDK功能所需权限：麦克风、麦克风设置、蓝牙连接、读取电话状态、访问网络、查看网络状态、查看WiFi状态;',
              'SDK 隐私政策链接：https://www.shengwang.cn/SDK-privacy-policy/;'
            ]
          }
        ]
      },
      {
        subTitle:
          '（4）当您选择参加我们及我们的关联方或平台上的第三方举办的营销活动时，可能需要您提供姓名、性别、通信地址、联系方式、银行账号信息。这些信息可能涉及敏感个人信息，拒绝提供可能会影响您参加相关活动，但不会影响其他功能。只有经过您的同意，我们才会将这些信息与关联方或第三方共享，以保障您在活动中获得体验一致的服务，或委托第三方及时向您兑现奖励。',
        list: []
      },
      {
        subTitle:
          '（5）与我们的关联公司必要共享：我们可能会与我们的关联公司共享您的个人信息。我们只会共享必要的个人信息，且这种共享受本政策所声明的目的的约束。关联公司如要改变个人信息的处理目的，将再次征得您的授权和同意。',
        list: []
      },
      {
        subTitle:
          '（6）您可以基于人生导师平台与第三人（包括不特定对象）共享您的个人信息或其他信息，但因您的共享行为而导致的信息泄露、被使用及相关情况，与人生导师无关，人生导师不因此承担法律责任。',
        list: []
      },
      {
        subTitle: '2.转让：',
        list: [
          {
            name: '转让是指将取得您个人信息的控制权转让给其他公司、组织或个人。除非获取您的明确同意，否则我们不会将您的个人信息转让给任何公司、组织或个人。但下述情形除外：',
            list: [
              '（1）事先已征得您的同意；',
              '（2）您自行提出的；',
              '（3）如果公司发生合并、分立、解散、被宣告破产，将可能涉及到个人信息转让，此种情况下我们会告知您接收方的名称或者姓名和联系方式并要求新的持有您个人信息的公司、组织继续受本政策的约束。若接收方变更个人信息处理目的、处理方式的，我们将要求其重新获取您的明示同意。',
              '（4）其他法律法规规定的情形。'
            ]
          }
        ]
      },
      {
        subTitle: '3.公开披露：',
        list: [
          {
            name: '公开披露是指向社会或不特定人群发布信息的行为。原则上，我们不会对您的个人信息进行公开披露。但下述情况除外：',
            list: [
              '（1）因公布账号中奖、处罚通知时展示必要的相关脱敏信息；',
              '（2）取得您的明示同意后。'
            ]
          }
        ]
      },
      {
        subTitle: '4.共享、转让、公开披露个人信息授权同意的例外情形：',
        list: [
          {
            name: '根据相关法律法规的规定，在以下情形中，我们可能在未事先征得您的授权同意的情况下共享、转让、公开披露您的个人信息：',
            list: [
              '（1）为订立、履行个人作为一方当事人的合同所必需，或者按照依法制定的劳动规章制度和依法签订的集体合同实施人力资源管理所必需；',
              '（2）为履行法定职责或者法定义务所必需；',
              '（3）为应对突发公共卫生事件，或者紧急情况下为保护自然人的生命健康和财产安全所必需；',
              '（4）为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息；',
              '（5）依照《个人信息保护法》规定在合理的范围内处理个人自行公开或者其他已经合法公开的个人信息；',
              '（6）法律法规规定的其他情形。请您了解，根据现行法律规定及监管要求，共享、转让经匿名化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，无需另行向您通知并征得您的同意。'
            ]
          }
        ]
      }
    ]
  },
  {
    title: '三、我们如何存储和保护您的个人信息',
    list: [
      {
        subTitle: '1.存储：',
        list: [
          {
            name: '存储地点：我们将从中华人民共和国境内获得的个人信息存放于中华人民共和国境内。以下情形下，我们会确保在履行了法律规定的义务后，向境外实体提供您的个人信息：',
            list: [
              '（1）适用的法律有明确规定;',
              '（2）获得您的明确授权;',
              '（3）您通过互联网进行跨境交易等个人主动行为。'
            ]
          },
          {
            name: '针对以上情形，我们会通过合同等形式确保以不低于本政策规定的程度保护您的个人信息。存储时间：我们承诺始终按照法律的规定在合理必要期限内在存储您个人信息。超出上述期限后，我们将删除您的个人信息或对您的个人信息进行匿名化处理。'
          },
          {
            name: '如我们停止运营，我们将及时停止收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，并对所持有的您的个人信息进行删除或匿名化处理。'
          }
        ]
      },
      {
        subTitle: '2.保护：',
        list: [
          {
            name: '为了保护您的个人信息安全，我们将努力采取各种符合行业标准的安全措施来保护您的个人信息以最大程度降低您的个人信息被毁损、盗用、泄露、非授权访问、使用、披露和更改的风险。我们将积极建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范个人信息的存储和使用，确保未收集与我们提供的服务无关的个人信息。'
          },
          {
            name: '您的账户均有安全保护功能，请妥善保管您的账户及密码信息。人生导师将通过向其它服务器备份、对用户密码进行加密及相关安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在“完善的安全措施”。为防止安全事故的发生，我们已按照法律法规的规定，制定了妥善的预警机制和应急预案。如确发生安全事件，我们将及时将相关情况选择以邮件、信函、电话、推送通知及相关方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况，紧密配合政府机关的工作。'
          },
          {
            name: '当我们的产品或服务发生停止运营的情形时，我们会及时停止继续收集个人信息的活动。上述变更，我们将以推送通知、公告及相关形式通知你，并在合理的期限内删除你的个人信息或进行匿名化处理（所谓“匿名化处理”，是指通过对个人信息的技术处理，使得个人信息主体无法被识别，且处理后的信息不能被复原的过程。个人信息经匿名化处理后所得的信息不属于个人信息。）'
          }
        ]
      }
    ]
  },
  {
    title: '四、您如何管理您的个人信息',
    remark: '我们非常重视并尽全力保障您对自己个人信息的相关权利。',
    list: [
      {
        subTitle: '1.自主决定接收信息',
        list: [
          {
            name: '会根据您是否打开导师模式决定是否接受信息，您可以根据需要自主选择打开或关闭。'
          }
        ]
      },
      {
        subTitle:
          '2.个人信息副本的访问、获取、更正和删除相关信息我们通过交互界面的设计，为您提供了可自行访问、获取、更正和删除相关个人信息的渠道，您可通过以下方式进行设置：',
        list: [
          {
            name: '',
            list: [
              '（1）通过【个人】访问、获取、更正自己的个人资料，含头像、昵称、性别、院校及入学时间、年龄、个人简介；',
              '（2）<span style="font-weight:600">通过【我-设置-账号与安全】设置、访问、获取、更正账号信息，含手机号（每月仅可换绑一次）、登录密码、绑定的第三方平台账号（含微信、微博和QQ账号）；</span>',
              '（3）<span style="font-weight:600">通过【我-设置-隐私】设置、访问、获取、更正隐私信息，含评论设置、@设置、通讯录推荐设置、微博推荐设置、位置信息设置和黑名单设置；</span>'
            ]
          },
          {
            name: '除上述外，有下列情形之一的，我们将应当主动删除您的个人信息，您也有权请求我们删除：',
            list: [
              '（1）处理目的已实现、无法实现或者为实现处理目的不再必要；',
              '（2）我们已停止提供产品或者服务，或者保存期限已届满；',
              '（3）您已明确撤回同意；',
              '（4）如您有足够的理由认为我们违反法律、行政法规或者违反约定处理您的个人信息；',
              '（5）法律、行政法规规定的其他情形。'
            ]
          }
        ]
      },
      {
        subTitle: '3.变更或撤回授权范围',
        list: [
          {
            name: '您可以通过设备本身操作系统变更或撤回您对通知、网络、悬浮窗、地理位置、存储（相册、媒体和其他文件）、电话状态权限的授权，不同设备型号的功能可能不尽相同，我们将根据您变更或撤回授权的设置进行个人信息的收集，如您撤回授权我们将不再收集与这些权限相关的信息，但提请您注意这将导致部分功能或全部功能的不可用。同时，您变更或撤回授权的决定，不会影响我们此前基于您的授权而进行的个人信息处理。'
          }
        ]
      },
      {
        subTitle: '4.附条件的个人信息转移权',
        list: [
          {
            name: '若您需要将您的个人信息转移至其他平台、企业或组织，您可以通过本隐私政策所披露的方式联系我们。我们将对您的请求进行审核，在符合我国网信部门规定的条件下，我们将为您提供转移相应个人信息的途径。'
          }
        ]
      },
      {
        subTitle: '5.约束信息系统自动决策',
        list: [
          {
            name: '在一些业务功能中，我们可能仅依据信息系统、算法在内的非人工自动决策机制作出决定。如果这些决定显著影响您的合法权益，您有权要求我们作出解释，我们也将提供适当的救济方式。'
          }
        ]
      },
      {
        subTitle:
          '6.在符合相关法律要求的情况下，您的近亲属可以对您的相关个人信息行使上述查阅、复制、更正、删除等权利；您另有安排的除外。',
        list: []
      },
      {
        subTitle: '7.联系我们进行管理',
        list: [
          {
            name: '出于安全性和身份识别的考虑，您可能无法直接通过人生导师交互界面自行访问、更正或删除某些信息（实名认证后的信息、您的部分使用记录及有关信息）；如您确有必要访问、修改或依法要求删除该类信息，请您按照本政策第十条中所提供的联系方式，将您的问题通过邮件发送至指定的联系邮箱，我们将尽快审核所涉问题，并在核验您的用户身份后及时予以回复。'
          }
        ]
      }
    ]
  },
  {
    title: '五、您如何注销您的账号',
    remark:
      '您可以通过【个人-设置-注销账号】，在满足账号注销的条件下选择【申请注销账号】，来注销您的账号；我们会在收到您的注销申请并验证您的用户身份后七个工作日内尽快为您处理。账号注销后，除法律明确规定必须由我们保留的个人信息外（如您在人生导师交易相关的信息），您的个人信息将会从人生导师移除。'
  },
  {
    title: '六、有关第三方提供产品和/或服务的特别说明',
    remark:
      '人生导师中可能包括第三方产品和/或服务或链接至第三方提供的信息和/或服务，该第三方产品和/或服务在使用前，您需要跳转到相应的小程序或第三方页面。您使用该第三方服务（包括您向该第三方提供的任何个人信息），须受该第三方的服务条款及隐私政策（而非本政策）约束，您需要仔细阅读其条款并自行决定是否接受。请您妥善保护自己的个人信息，仅在必要的情况下向他人提供。本政策仅适用于我们所收集、保存、使用、共享、披露信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，第三方使用您信息时的行为由其自行负责。'
  },
  {
    title: '七、我们如何使用Cookie和其他同类技术',
    list: [
      {
        subTitle: '1.Cookies的使用',
        list: [
          {
            name: '（1）在您接受cookies的情况下，人生导师会在您的计算机以及相关移动设备上设定或取用cookies，以便您能登录或使用依赖于cookies的人生导师平台服务或功能，包括推广服务。'
          },
          {
            name: '（2）您有权选择接受或拒绝接受cookies。您可以通过修改浏览器设置的方式或在移动设备中设置拒绝接受cookies。但如果您选择拒绝接受cookies，则您可能无法登录或使用依赖于cookies的人生导师平台服务或功能。'
          },
          {
            name: '（3）通过人生导师所设cookies所取得的有关信息，将适用本政策。'
          }
        ]
      }
    ]
  },
  {
    title: '八、未成年人保护',
    list: [
      {
        subTitle:
          '以下条款请未成年用户（特别是未满十四周岁的儿童用户）在监护人的陪同下仔细阅读，并由监护人在充分理解后作出是否接受或拒绝本政策的决定：',
        list: [
          {
            name: '1.若用户是未满18周岁的未成年人（特别是未满十四周岁的儿童用户），应在监护人监护、指导并获得监护人同意情况下阅读本协议和使用人生导师相关服务。'
          },
          {
            name: '2.我们重视对未成年人个人信息的保护，未成年用户在填写个人信息时，请加强个人保护意识并谨慎对待，请在监护人指导时正确使用人生导师相关服务。'
          },
          {
            name: '3.我们将根据国家相关法律法规及本政策的规定保护未成年人用户信息的保密性及安全性。如果我们发现自己在未事先获得可证实的父母或法定监护人同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据。同时我们建立了严格的未成年人信息收集使用规则，以保护儿童和青少年个人信息安全。若您是未成年人的监护人，当您对您所监护的未成年人使用我们的服务或其向我们提供的用户信息有任何疑问时，请您根据本政策第十条提供的联系方式及时与我们联系。'
          }
        ]
      }
    ]
  },
  {
    title: '九、我们如何更新隐私政策',
    list: [
      {
        subTitle:
          '1.为了给您提供更好的服务，我们会根据产品的更新情况及法律法规的相关要求更新本政策的条款，这些更新将构成本政策的一部分。未经您明确同意，我们不会削减您依据当前生效的本政策所应享受的权利。',
        list: []
      },
      {
        subTitle:
          '2.如遇本政策更新，我们会通过APP客户端推送通知或其他合理方式通知您，以便您能及时了解本政策的最新版本。',
        list: []
      }
    ]
  },
  {
    title: '十、如何联系我们',
    list: [
      {
        subTitle:
          '如您对个人信息保护问题有任何投诉、建议、疑问，或您对本政策有任何疑问，您可以通过以下方式联系我们，我们将尽快审核所涉问题，并在验证您的用户身份后的十五个工作日内予以答复：bjyqkeji@163.com。',
        list: []
      }
    ]
  },
  {
    title: '十一、其他',
    list: [
      {
        subTitle:
          '1.因本政策以及我们处理您个人信息事宜引起的任何争议，您可诉至北京市海淀区人民法院。',
        list: []
      },
      {
        subTitle:
          '2.如果您认为我们的个人信息处理行为损害了您的合法权益，您也可向有关政府部门进行反映。',
        list: []
      }
    ]
  }
];
</script>

<style scoped lang="less">
.home-container {
  width: 100vw;
  height: 100vh;
  background-color: #fff;
  overflow: auto;
  padding: 20px;
}

.title {
  text-align: center;
  font-size: 48px;
  margin: 15px 0px 20px;
  font-weight: 600;
}

.update-time {
  font-size: 26px;
  padding: 10px 0px;
  display: flex;
  align-items: flex-end;
  flex-direction: column;
}

.main-title {
  line-height: 60px;
  font-size: 32px;
  font-weight: 600;
  margin-top: 10px;
}

.remark {
  font-size: 28px;
  font-weight: 600;
}

.sub-title {
  font-size: 28px;
  font-weight: 600;
  margin: 5px 0px;
}

.item-name {
  font-size: 26px;
  margin-top: 5px;
}

.item-list {
  font-size: 25px;
  margin-top: 5px;
}
</style>
